<?php
/*Циклы
1) Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных и отрицательных элементов этого массива. Например массив: $arr = [2, -5, -9, 15, 11, -4, 7, 1, -10];
2) Дано число, например 30. У этого числа есть делители - числа, на которое оно делится без остатка. Делители числа 30 - это 1, 2, 3, 5, 6, 10, 15, 30. Задача: сделайте массив делителей нашего числа и вывести его. Число может быть любым, не обязательно, 30.
3) Нарисуйте пирамиду, как показано ниже, только у этом пирамиды должно быть не 5 рядов, а произвольное количество, оно задается переменной так: $number = 5; - это первый ряд пирамиды.
xxxxx
xxxx
xxx
xx
x*/